<a href="https://colab.research.google.com/github/riyan518z/notes/blob/main/sql.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import sqlite3

conn = sqlite3.connect("students.db")
cursor = conn.cursor()

In [ ]:
from typing import Text

cursor.execute("""create table if not exists students (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT,
    age Integer,
    Gender Text,
    grade Text
   )

""")

In [ ]:
cursor.execute("insert into students values (123,'abc',18,'m','a')")

In [ ]:
cursor.execute("insert into students values (124,'abd',19,'m','b')")

In [ ]:
cursor.execute("insert into students values (125,'aba',20,'m','c')")

In [ ]:
cursor.execute("insert into students values (122,'acc',18,'m','a+')")

In [ ]:
cursor.execute("insert into students values (113,'ccc',18,'m','b+')")

In [ ]:
conn.commit()

In [ ]:
cursor.execute("SELECT * FROM  students")

In [ ]:
 #a  = cursor.fetchall()
 print (a)

[(113, 'ccc', 18, 'm', 'b+'), (122, 'acc', 18, 'm', 'a+'), (123, 'abc', 18, 'm', 'a'), (124, 'abd', 19, 'm', 'b'), (125, 'aba', 20, 'm', 'c')]

In [ ]:
#print(cursor.fetchall())

In [ ]:
rows = cursor.fetchall()

In [ ]:
for row in rows :
  print("id:",row[0],"name" ,row[1],"age:",row[2],"gender :",row[3],'grade',row[4])

id: 113 name ccc age: 18 gender : m grade b+
id: 122 name acc age: 18 gender : m grade a+
id: 123 name abc age: 18 gender : m grade a
id: 124 name abd age: 19 gender : m grade b
id: 125 name aba age: 20 gender : m grade c

In [ ]:
cursor.execute("select * from students where grade = 'a' ")
rows = cursor.fetchall()
for row in rows:
  print("id:",row[0],"name" ,row[1],"age:",row[2],"gender :",row[3],'grade',row[4])

id: 123 name abc age: 18 gender : m grade a

In [ ]:
cursor.execute("select * from students order by age desc")
rows = cursor.fetchall()
for row in rows:
  print("id:",row[0],"name" ,row[1],"age:",row[2],"gender :",row[3],'grade',row[4])

id: 125 name aba age: 20 gender : m grade c
id: 124 name abd age: 19 gender : m grade b
id: 122 name acc age: 18 gender : m grade a+
id: 123 name abc age: 18 gender : m grade a

In [ ]:
cursor.execute ("select count(*) from students where grade = 'a' ")
rows = cursor.fetchall()
for row in rows:
  print('grade',row[0])

grade 1

In [ ]:
cursor.execute("select avg(age) from students where age < 17 ")
rows = cursor.fetchall()
for row in rows:
  print("age:",row[0])

age: None

In [ ]:
cursor.execute ("select * from students order by age desc limit 3")
rows = cursor.fetchall()
for row in rows:
  print("id:",row[0],"name" ,row[1],"age:",row[2],"gender :",row[3],'grade',row[4])

id: 125 name aba age: 20 gender : m grade c
id: 124 name abd age: 19 gender : m grade b
id: 122 name acc age: 18 gender : m grade a+

In [ ]:
cursor.execute ("select age,count(*) from students group by age")
rows = cursor.fetchall()
for row in rows:
  print("age:",row[0])

age: 18
age: 19
age: 20

In [ ]:
cursor.execute("alter table students add column mark integer")

In [ ]:
cursor.execute("select * from students")

In [ ]:
row1 = cursor.fetchall()

In [ ]:
for row in row1 :
  print("id:",row[0],"name" ,row[1],"age:",row[2],"gender :",row[3],'grade',row[4],'mark',row[5])

id: 113 name ccc age: 18 gender : m grade b+ mark None
id: 122 name acc age: 18 gender : m grade a+ mark None
id: 123 name abc age: 18 gender : m grade a mark None
id: 124 name abd age: 19 gender : m grade b mark None
id: 125 name aba age: 20 gender : m grade c mark None

In [ ]:
cursor.execute ("update students set mark = 80 where id = 113")
cursor.execute ("update students set mark = 70 where id = 122")
cursor.execute ("update students set mark = 55 where id = 123")
cursor.execute ("update students set mark = 66 where id = 124")
cursor.execute ("update students set mark = 40 where id = 125")

In [ ]:
cursor.execute("select * from students")
rows = cursor.fetchall()
for row in rows:
  print("id:",row[0],"name" ,row[1],"age:",row[2],"gender :",row[3],'grade',row[4],'mark',row[5])

id: 113 name ccc age: 18 gender : m grade b+ mark 80
id: 122 name acc age: 18 gender : m grade a+ mark 70
id: 123 name abc age: 18 gender : m grade a mark 55
id: 124 name abd age: 19 gender : m grade b mark 66
id: 125 name aba age: 20 gender : m grade c mark 40

In [ ]:
cursor.execute("delete from students where id = 113")

In [ ]:
cursor.execute("select * from students")
rows = cursor.fetchall()
for row in rows:
  print("id:",row[0],"name" ,row[1],"age:",row[2],"gender :",row[3],'grade',row[4],'mark',row[5])

id: 122 name acc age: 18 gender : m grade a+ mark 70
id: 123 name abc age: 18 gender : m grade a mark 55
id: 124 name abd age: 19 gender : m grade b mark 66
id: 125 name aba age: 20 gender : m grade c mark 40

In [ ]:
import sqlite3
conn = sqlite3.connect('lib.db')
cursor = conn.cursor()

In [ ]:
from typing import Text
cursor.execute("""CREATE TABLE IF NOT EXISTS lib(
    bookid INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT,
    author TEXT,
    pdate DATE
    )
   """)